# StdPostedWarning Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StdPostedWarning Class
Members See Also
---
Support for Reviewable Warnings sent from AddOn.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public class StdPostedWarning : IDisposable
```

Visual Basic
---
```text
Public Class StdPostedWarning _
	Implements IDisposable
```

Visual C++
---
```text
public ref class StdPostedWarning : IDisposable
```

# Remarks
Used to create and send Reviewable Warning from AddOn.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..StdPostedWarning
# See Also
StdPostedWarning Members
Autodesk.Revit.DB Namespace